# Academy of Py

### District Summary
Total Schools: 15  
Total Students: 39170  
Total Budget: $24,649,428  
Average Math Score: 78.98%  
Average Reading Score: 81.87%  
% Passing Math: 72.39%  
% Passing Reading: 82.97%   
Overall Passing Rate (Average of the above two): 77.68%   

## School Summary
School Name:  
School Type:  
Total Students:  
Total School Budget:  
Per School Budget:  
Average Math Score:  
Average Reading Score:  
% Passing Math:  
% Passing Reading:  
Overall Passing Rate (Average of the above two):  

## Top Performing Schools (By Passing Rate)
School Name:  
School Type:  
Total Students:  
Total School Budget:  
Per School Budget:  
Average Math Score:  
Average Reading Score:  
% Passing Math:  
% Passing Reading:  
Overall Passing Rate (Average of the above two):

In [1]:
import pandas as pd 
import numpy as np

In [2]:
schools_file = "raw_data/schools_complete.csv"
students_file = "raw_data/students_complete.csv"

In [3]:
schools_pd = pd.read_csv(schools_file, encoding='iso-8859-1')
schools_pd.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
students_pd = pd.read_csv(students_file, encoding='iso-8859-1')
students_pd.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
students_pd.columns

Index(['Student ID', 'name', 'gender', 'grade', 'school', 'reading_score',
       'math_score'],
      dtype='object')

In [6]:
students_pd.dtypes

Student ID        int64
name             object
gender           object
grade            object
school           object
reading_score     int64
math_score        int64
dtype: object

In [7]:
schools_count = schools_pd["name"].count()
schools_count

15

In [8]:
students_count = students_pd["name"].count()
students_count

39170

In [9]:
total_budget = schools_pd["budget"].sum()
total_budget

24649428

In [10]:
avg_readingscore = students_pd['reading_score'].mean()
avg_readingscore

81.87784018381414

In [11]:
avg_mathscore = students_pd['math_score'].mean()
avg_mathscore

78.98537145774827

In [47]:
passing_math = (students_pd.loc[students_pd["math_score"]>70])
overall_passing_math = passing_math['math_score'].count()
overall_passing_math = overall_passing_math / students_count * 100
overall_passing_math

72.392136839417915

In [49]:
passing_reading = (students_pd.loc[students_pd["reading_score"]>70])
overall_passing_reading = passing_reading['reading_score'].count()
overall_passing_reading = overall_passing_reading / students_count * 100
overall_passing_reading

82.971661986213945

In [50]:
overall_passing_grade = (overall_passing_math + overall_passing_reading) / 2
overall_passing_grade

77.681899412815937

In [52]:
dh = schools_pd.set_index("name") 
dh.head()

                       School ID      type  size   budget
name
Huang High School              0  District  2917  1910635
Figueroa High School           1  District  2949  1884411
Shelton High School            2   Charter  1761  1056600
Hernandez High School          3  District  4635  3022020
Griffin High School            4   Charter  1468   917500